RT-Thread-Studio/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/connectivity-utilities/network/COMPONENT_LWIP/cy_nw_helper.c
/*
 * $ Copyright Cypress Semiconductor $
 */

/** @file
 *
 * Network helper library for FreeRTOS
 */

#include "lwip/dhcp.h"
#include "lwip/ip4_addr.h"      // NOTE: LwIP specific - ip4_addr
#include "lwip/netif.h"         // NOTE: LwIP specific - for etharp_cleanup_netif()
#include "lwip/etharp.h"        // NOTE: LwIP specific - for netif_list for use in etharp_cleanup_netif() call
#include "cy_nw_helper.h"
#include "cyabs_rtos.h"
#include "cy_network_mw_core.h"
#include <string.h>

#ifdef __cplusplus
extern "C" {
#endif


static struct netif *nw_get_our_netif(void)
{
#if defined(CYBSP_ETHERNET_CAPABLE)
    struct netif *net = (struct netif *)cy_network_get_nw_interface(CY_NETWORK_ETH_INTERFACE, 1);
#else
    struct netif *net = (struct netif *)cy_network_get_nw_interface(CY_NETWORK_WIFI_STA_INTERFACE, 0);
#endif
    return net;
}

void cy_nw_ip_initialize_status_change_callback(cy_nw_ip_status_change_callback_t *cb, cy_nw_ip_status_change_callback_func_t *cb_func, void *arg)
{
    /* This function is not implemented for COMPONENT_LWIP. Expectation is to use the Wi-Fi Connection Manager library (WCM) for IP status change callback */
    printf("Not implemented for COMPONENT_LWIP. Use Wi-Fi Connection Manager WCM APIs instead\n");
    return;
}

#if LWIP_IPV4

bool cy_nw_ip_get_ipv4_address(cy_nw_ip_interface_t nw_interface, cy_nw_ip_address_t *ip_addr)
{
#if defined(CYBSP_ETHERNET_CAPABLE)
    struct netif *net = (struct netif *)cy_network_get_nw_interface(CY_NETWORK_ETH_INTERFACE, 1);
#else
    struct netif *net = (struct netif *)cy_network_get_nw_interface(CY_NETWORK_WIFI_STA_INTERFACE, 0);
#endif

    if (net != NULL && ip_addr != NULL)
    {
#if LWIP_IPV6 && LWIP_IPV4
        uint32_t ipv4 = net->ip_addr.u_addr.ip4.addr;
#else
        uint32_t ipv4 = net->ip_addr.addr;
#endif
        if (ipv4 != 0UL)
        {
            ip_addr->ip.v4 = ipv4;
            ip_addr->version = NW_IP_IPV4;
            return true;
        }
    }
    return false;
}

int cy_nw_str_to_ipv4(const char *ip_str, cy_nw_ip_address_t *address)
{
    ip4_addr_t addr;
    if (ip_str == NULL || address == NULL)
    {
        return -1;
    }

    if (ip4addr_aton(ip_str, &addr))
    {
        address->ip.v4 = addr.addr;
        address->version = NW_IP_IPV4;
        return 0;
    }
    return -1;
}
#endif //LWIP_IPV4

void cy_nw_ip_register_status_change_callback(cy_nw_ip_interface_t nw_interface, cy_nw_ip_status_change_callback_t *cb)
{
    /* This function is not implemented for COMPONENT_LWIP. Expectation is to use the Wi-Fi Connection Manager library (WCM) for IP status change callback */
    printf("Not implemented for COMPONENT_LWIP. Use Wi-Fi Connection Manager WCM APIs instead\n");
    return;
}

void cy_nw_ip_unregister_status_change_callback(cy_nw_ip_interface_t nw_interface, cy_nw_ip_status_change_callback_t *cb)
{
    /* This function is not implemented for COMPONENT_LWIP. Expectation is to use the Wi-Fi Connection Manager library (WCM) for IP status change callback */
    printf("Not implemented for COMPONENT_LWIP. Use Wi-Fi Connection Manager WCM APIs instead\n");
    return;
}

#if LWIP_IPV4 && LWIP_ARP
int cy_nw_host_arp_cache_clear(cy_nw_ip_interface_t iface)
{
    struct netif *netif;

    netif = nw_get_our_netif();
    if (netif != NULL)
    {
        etharp_cleanup_netif(netif);
    }
    return 0;
}

int cy_nw_host_arp_cache_get_list(cy_nw_ip_interface_t iface, cy_nw_arp_cache_entry_t *list, uint32_t count, uint32_t *filled)
{
    uint8_t index;
    struct ip4_addr *ipaddr_ptr;
    struct netif *netif_ptr;
    struct eth_addr *eth_ret_ptr;
    struct netif *netif;

    *filled = 0;

    netif = nw_get_our_netif();
    if (netif != NULL)
    {
        for (index = 0 ; index < ARP_TABLE_SIZE; index++)
        {
            if (etharp_get_entry(index, &ipaddr_ptr, &netif_ptr, &eth_ret_ptr) == 1)
            {
                list[*filled].ip.version = NW_IP_IPV4;
                list[*filled].ip.ip.v4 = ipaddr_ptr->addr;
                memcpy(list[*filled].mac.mac, eth_ret_ptr->addr, sizeof(list->mac.mac));

                *filled = *filled + 1;
                if (*filled >= count)
                {
                    break;
                }
            }
            else
            {

            }
        }
        /* The query was successful */
        return 0;
    }

    return 1;
}

int cy_nw_host_send_arp_request(cy_nw_ip_interface_t ipiface, const char *ip_string)
{
    ip4_addr_t ipv4addr;
    struct netif *netif;

    ipv4addr.addr = ipaddr_addr(ip_string);
    netif = nw_get_our_netif();

    if (netif != NULL)
    {
        err_t err = etharp_request(netif, &ipv4addr);
        return err;
    }
    return 1;
}
#endif /* LWIP_IPV4 && LWIP_ARP */

uint32_t cy_nw_get_time(void)
{
    cy_time_t systime;
    cy_rtos_get_time(&systime);
    return systime;
}

#ifdef __cplusplus
}
#endif
